// Вид 1: Ничего не принимают, ничего не возвращают
/*
void Method1()
{
    Console.WriteLine("Автор Екатерина К.");
}
*/
// Method1();
//--------------------------------------------------------------------------------------------------

//Вид 2: Что-то принимают, ничего не возвращают
/*
void Method2(string msg)
{
     Console.WriteLine(msg);
}
Method2(msg: "Текст сообщения"); // именованный аргумент - когда необходимо задать значение конкретному аргументу
*/
/*
void Method21(string msg, int count)
{
    int i = 0;
    while (i < count)
    {
        Console.WriteLine(msg);
        i++;
    } 
}
Method21(count: 4, msg: "текст сообщения"); // можно перечислять в любом порядке
*/
//--------------------------------------------------------------------------------------------------

//Вид 3: Ничего не принимают, что-то возвращают
/*
int Method3()
{
    return DateTime.Now.Year;
}
int year = Method3(); // можем далее использовать переменную в пограмме
Console.WriteLine(year);
*/
//--------------------------------------------------------------------------------------------------

//Вид 4: Что-то принимают и что-то возвращают

string Method4(int count, string text)
{
    int i = 1;
    string result = String.Empty;

    while (i <= count)
    {
        result += text;
        i++;
    }
    return result;
}

// string res = Method4(10, "aca-");
string res = Method4(text: "==/", count: 5);
Console.WriteLine(res);

//--------------------------------------------------------------------------------------------------
